results/functional_test_results/k6_functional_test.txt
     █ Verify GET all users from a page

       ✓ expected GET all users from a page to equal 200

     █ Verify Add(POST) user

       ✓ expected User added with POST request to equal 201
       ✓ expected name not to be null
       ✓ expected job not to be null

   ✓ checks.........................: 100.00% ✓ 4        ✗ 0
     data_received..................: 4.3 kB  10 kB/s
     data_sent......................: 648 B   1.6 kB/s
     group_duration.................: avg=207.34ms min=111.14ms med=207.34ms max=303.53ms p(90)=284.29ms p(95)=293.91ms
     http_req_blocked...............: avg=39.04ms  min=1µs      med=39.04ms  max=78.08ms  p(90)=70.27ms  p(95)=74.18ms 
     http_req_connecting............: avg=8.71ms   min=0s       med=8.71ms   max=17.43ms  p(90)=15.69ms  p(95)=16.56ms 
     http_req_duration..............: avg=160.57ms min=29.16ms  med=160.57ms max=291.98ms p(90)=265.7ms  p(95)=278.84ms
       { expected_response:true }...: avg=160.57ms min=29.16ms  med=160.57ms max=291.98ms p(90)=265.7ms  p(95)=278.84ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 2
     http_req_receiving.............: avg=269.5µs  min=101µs    med=269.49µs max=438µs    p(90)=404.3µs  p(95)=421.14µs
     http_req_sending...............: avg=439µs    min=218µs    med=439µs    max=660µs    p(90)=615.8µs  p(95)=637.9µs 
     http_req_tls_handshaking.......: avg=14.38ms  min=0s       med=14.38ms  max=28.77ms  p(90)=25.89ms  p(95)=27.33ms 
     http_req_waiting...............: avg=159.86ms min=28.06ms  med=159.86ms max=291.66ms p(90)=265.3ms  p(95)=278.48ms
     http_reqs......................: 2       4.812065/s
     iteration_duration.............: avg=414.9ms  min=414.9ms  med=414.9ms  max=414.9ms  p(90)=414.9ms  p(95)=414.9ms 
     iterations.....................: 1       2.406032/s